app/controllers/short_urls_controller.rb

  def index
    @shortUrls = ShortUrl.select(["id","full_url", "short_code", "click_count", "title"]).order(click_count: :desc).limit(100)
---
SELECT COUNT(`short_urls`.`short_code`) FROM `short_urls`
SELECT `short_urls`.`id`, `short_urls`.`full_url`, `short_urls`.`short_code`, `short_urls`.`click_count`, `short_urls`.`title` FROM `short_urls` ORDER BY `short_urls`.`click_count` DESC LIMIT 100

  def create
    @shortUrl = ShortUrl.create(full_url: params[:full_url])
---
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`, `short_code`) VALUES ('https://www.test.rspec', '2022-10-30 00:43:52.424731', '2022-10-30 00:43:52.424731', '0')

  def show
    @shortUrl = ShortUrl.where(short_code: params[:id]).first
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`short_code` = '0' ORDER BY `short_urls`.`id` ASC LIMIT 1