app/models/short_url.rb

SELECT COUNT(`short_urls`.`short_code`) FROM `short_urls`
---
  def short_code_generator
    code = ""
    # First we need to count how many records we have
    totRecords = ShortUrl.count(:short_code)

UPDATE `short_urls` SET `short_urls`.`click_count` = COALESCE(`short_urls`.`click_count`, 0) + 1 WHERE `short_urls`.`id` = 9
---
  def increase_count
    self.increment!(:click_count)