app/jobs/update_title_job.rb

  def perform(short_url)
    # First we use open to get the html
    # file from the url
    URI.open(short_url[:full_url]) do |file|
      # with the document opened we extract the title
      doc = Nokogiri::HTML(file)
      pageTitle =  doc.at_css('title').text
      # then just save it in the database
      short_url.title = pageTitle
      short_url.save
---
UPDATE `short_urls` SET `short_urls`.`title` = 'Google', `short_urls`.`updated_at` = '2022-10-30 02:27:45.285209' WHERE `short_urls`.`id` = 18